[
    {
        "title": "My doctor, and myself and my child — that's who makes the decision (Whoopi Goldberg)",
        "body": "I found out I was pregnant when I was 14. I didn't get a period. I talked to nobody. I panicked. I sat in hot baths. I drank these strange concoctions girls told me about — something like Johnny Walker Red with a little bit of Clorox, alcohol, baking soda (which probably saved my stomach) and some sort of cream. You mixed it all up. I got violently ill. At that moment I was more afraid of having to explain to anybody what was wrong than of going to the park with a hanger, which is what I did."
    },
    {
        "title": "I had an abortion (Jameela Jamil)",
        "body": "I used two types of contraception, they both failed, and I aborted at 8 weeks. I was mentally/physically/emotionally and financially unstable and most importantly DID NOT WANT A CHILD. That should be enough. My life matters more than an unborn human. I had not a minute of regret. I only felt deep relief and gratitude that I lived in a country that made abortion accessible and safe. Nobody made me feel bad for being there. They just gave me HEALTHCARE, because that is what abortion is. Banning it won't stop abortion. It will ONLY stop SAFE abortion. Especially for the disadvantaged."
    },
    {
        "title":"I had the choice (Laura Prepon)",
        "body": "One of the worst days of my life was when I made the choice to terminate a pregnancy in the second trimester. The devastating truth is that we found out the fetus would not survive to full term, and that my life was at risk as well. At the time - I had the choice. Everyone has their own story for seeking out this medical procedure and I empathize with anyone who's been faced with this impossible decision. I am praying for all of us, that we can get through this challenging time and regain agency over our own bodies."
    },
    {
        "title": "Being a mother on my own terms (Madeline Brewer)",
        "body": "idk how to post right now the air feels weird i'm a depresso martini idk i had an abortion when i was 20 i hated myself and my body and punished myself for years but i never even for the blink of an eye regretted it. today my life is mine. i can't wait to be a mother someday on my own terms."
    },
    {
        "title": "It's called an 'Abortion!' (Hilarie Burton)",
        "body": "My beloved. My daughter. It is no secret I struggled with infertility. Losing multiple pregnancies before her was traumatic. But female bodies are all different and unpredictable. Having an abortion after my fetus died allowed for my uterus to heal in a way that made it healthy enough to carry future pregnancies. It doesn't matter if you use the term D&C. The official word on the hospital paperwork is abortion. That’s what it was. You know what would have made that painful day even worse? If abortion had been illegal, and law enforcement inspected my body to make sure I hadn’t caused my own miscarriage. Cause that’s what’s coming. It’s already happened. It was commonplace before #roevwade. Row V Wade protected my rights as a woman to have miscarriages without scrutiny. Now I know a lot of you have miscarried. You’ve written me to tell me about it. Think about every loss and then compound it by knowing that the Supreme Court just said it’s okay for states to look at you as a murder suspect in that situation. Your miscarriage will make you a murder suspect. I can’t say this clearly enough or shout it loud enough. I only have my daughter because of my abortion. So fuck you very much to the Supreme Court. And fuck you to the ignorant right wing extremists who want my daughter to have fewer rights than what I was born with. #wewillnotgoback"
    },
    {
        "title": "It was easy. Everyone deserves that kind of access (Phoebe Bridgers)",
        "body": "All these irrelevant old motherfuckers trying to tell us what to do with our fucking bodies."
    },
    {
        "title": "No regrets. It's nobody's business (Cheryl Burke)",
        "body": "I would be a mother and I wouldn't have been a great mother and I definitely wouldn't be sitting here with you today. I was two weeks pregnant when I got an abortion and I remember rolling up to Planned Parenthood with picketers holding anti-abortion signs and that alone was traumatic. On top of it all, the whole process is traumatic, and the fact that now you're making it illegal for us women to make this decision about our own bodies is absolutely insanity."
    },
    {
        "title": "Banning abortion doesn't prevent abortions, it prevents safe abortions (Meadow Walker)",
        "body": "I too have battled with the choice but in 2020, when the world was collapsing during the pandemic, I sought an abortion. It is a very private and personal experience — the way it should be. I was lucky enough to have a great doctor who supported me through the debilitating process — with their help, I am able to be the happy and healthy person I am today. Now, knowing even more women won't have the opportuity to seek safe termination and choose their bodies first is absolutely heartbreaking. In a world that constantly marginalizes females, this feels like the biggest assault of them all. Banning abortion doesn't prevent abortions, it prevents safe abortions."
    },
    {
        "title": "My abortion saved my life (Halsey)",
        "body":"I miscarried three times before my 24th birthday. It seemed a cruel irony that I could get pregnant with ease but struggled to maintain a pregnancy. One of my miscarriages required “aftercare,” a gentle way of saying that I would need an abortion, because my body could not terminate the pregnancy completely on its own and I would risk going into sepsis without medical intervention. During this procedure, I cried. I was afraid for myself and I was helpless. I was desperate to end the pregnancy that was threatening my life."
    }
]