[{"state":"Alabama","abbr":"AL","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Arkansas","abbr":"AR","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Idaho","abbr":"ID","status":"Banned","legalUntil":"—","why":"Nearly all abortions are banned, but a federal judge has blocked a piece of the law, ruling that doctors could not be punished for performing an abortion to protect a patient’s health. Abortion advocates and the Department of Justice have sued to challenge the bans.","fill":"#870000"},{"state":"Kentucky","abbr":"KY","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Louisiana","abbr":"LA","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Mississippi","abbr":"MS","status":"Banned","legalUntil":"—","why":"Abortion is banned with exceptions for rape, but not incest.","fill":"#870000"},{"state":"Missouri","abbr":"MO","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Oklahoma","abbr":"OK","status":"Banned","legalUntil":"—","why":"Abortion is banned at the point of fertilization.","fill":"#870000"},{"state":"South Dakota","abbr":"SD","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Tennessee","abbr":"TN","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"Texas","abbr":"TX","status":"Banned","legalUntil":"—","why":"Abortion is banned with no exceptions for rape or incest.","fill":"#870000"},{"state":"West Virginia","abbr":"WV","status":"Banned","legalUntil":"—","why":"Nearly all abortions are banned as of Sept. 16.","fill":"#870000"},{"state":"Wisconsin","abbr":"WI","status":"Banned","legalUntil":"—","why":"The state has a law from before Roe that bans abortion with no exceptions for rape or incest, and makes performing the procedure a felony. The Democratic governor and attorney general have filed a lawsuit in an attempt to block the ban.","fill":"#870000"},{"state":"Georgia","abbr":"GA","status":"Gestational limit","legalUntil":"6 weeks","why":"Abortion is banned after six weeks of pregnancy, after a court allowed a 2019 law to go into effect. Abortion rights groups have sued to block the ban.","fill":"#D68671"},{"state":"Arizona","abbr":"AZ","status":"Gestational limit","legalUntil":"15 weeks","why":"A state court temporarily blocked enforcement of an 1864 law that banned abortion with no exceptions for rape or incest. A separate ban on abortion after 15 weeks of pregnancy is in effect.","fill":"#D68671"},{"state":"Florida","abbr":"FL","status":"Gestational limit","legalUntil":"15 weeks","why":"Abortion is banned after 15 weeks of pregnancy. Abortion providers and advocates have sued to block the ban. The state’s Supreme Court recognized the right to an abortion in its Constitution three decades ago, but the court has become more conservative, with three of the seven judges appointed by the Republican governor.","fill":"#D68671"},{"state":"Utah","abbr":"UT","status":"Gestational limit","legalUntil":"18 weeks","why":"A judge temporarily blocked the state’s trigger ban on most abortions. A ban on abortion after 18 weeks of pregnancy is in effect.","fill":"#D68671"},{"state":"North Carolina","abbr":"NC","status":"Gestational limit","legalUntil":"20 weeks","why":"Abortion is banned at 20 weeks of pregnancy, after a federal judge allowed an older law to go into effect. The governor has issued an executive order to shield those seeking or providing abortions in North Carolina from laws in other states.","fill":"#D68671"},{"state":"Indiana","abbr":"IN","status":"Ban blocked","legalUntil":"22 weeks","why":"A judge has blocked a ban on nearly all abortions while a lawsuit against it proceeds. The Indiana Supreme Court will hear oral arguments in the case in January.","fill":"#efdbcb"},{"state":"Iowa","abbr":"IA","status":"Ban blocked","legalUntil":"22 weeks","why":"In June, the state’s Supreme Court overruled a 2018 decision that said the right to an abortion was protected under the State Constitution. A ban on abortion after six weeks has been blocked by a judge since 2019, but the governor is seeking its enforcement.","fill":"#efdbcb"},{"state":"North Dakota","abbr":"ND","status":"Ban blocked","legalUntil":"22 weeks","why":"A judge temporarily blocked a ban on nearly all abortions, after the state’s sole abortion provider filed a lawsuit challenging the ban.","fill":"#efdbcb"},{"state":"Michigan","abbr":"MI","status":"Ban blocked","legalUntil":"Viability","why":"The state has a law from before Roe that bans nearly all abortions, but it has been blocked in state court. The Democratic governor and attorney general have said they will not enforce the ban. The governor issued an executive order to shield those seeking or providing abortions in Michigan from laws in other states.","fill":"#efdbcb"},{"state":"Montana","abbr":"MT","status":"Ban blocked","legalUntil":"Viability","why":"The Legislature passed three anti-abortion laws in 2021, including a ban on abortion after 20 weeks of pregnancy, all of which have been blocked by a court since last year. The Montana Supreme Court has ruled that its Constitution protects the right to an abortion.","fill":"#efdbcb"},{"state":"Ohio","abbr":"OH","status":"Ban blocked","legalUntil":"22 weeks","why":"A judge indefinitely blocked the state’s ban on abortion after six weeks of pregnancy while a lawsuit against it proceeds.","fill":"#efdbcb"},{"state":"South Carolina","abbr":"SC","status":"Ban blocked","legalUntil":"22 weeks","why":"The South Carolina Supreme Court temporarily blocked a ban on abortion after six weeks of pregnancy; a lower court judge had allowed the ban to take effect in June. Lawmakers are working on a bill that would ban or further restrict abortion.","fill":"#efdbcb"},{"state":"Wyoming","abbr":"WY","status":"Ban blocked","legalUntil":"Viability","why":"A judge temporarily blocked a ban on nearly all abortions on July 27, the same day the ban was set to take effect.","fill":"#efdbcb"},{"state":"Colorado","abbr":"CO","status":"Legal but limited","legalUntil":"No gestational limit","why":"State law protects abortion, but a 1984 law prohibits using state funds to cover the cost of most abortions. In July, the governor issued an executive order to shield those seeking or providing abortions in Colorado from laws in other states.","fill":"#b3d0c7"},{"state":"Delaware","abbr":"DE","status":"Legal but limited","legalUntil":"Viability","why":"State law protects abortion and a new law expands access to providers, but state funds cannot be used to cover the cost of the procedure.","fill":"#b3d0c7"},{"state":"Kansas","abbr":"KS","status":"Legal but limited","legalUntil":"22 weeks","why":"The state’s Supreme Court ruled in 2019 that a pregnant woman’s right to personal autonomy is protected in its Constitution, and Kansans voted on Aug. 2 to reject a ballot measure that would have amended the State Constitution to say it contains no right to an abortion. State funds cannot be used to cover the cost of most abortions, and the state has enacted multiple restrictions that limit access to the procedure.","fill":"#b3d0c7"},{"state":"Nebraska","abbr":"NE","status":"Legal but limited","legalUntil":"22 weeks","why":"A bill to enact a trigger ban failed in the Legislature earlier this year, before the Supreme Court overturned Roe. The state has enacted multiple restrictions that limit access to the procedure, including a ban on abortion after 22 weeks, and state funds cannot be used to cover the cost of most abortions. The governor said in August that he does not have enough votes to pass a more restrictive ban.","fill":"#b3d0c7"},{"state":"Nevada","abbr":"NV","status":"Legal but limited","legalUntil":"24 weeks","why":"State law protects abortion but state funds cannot be used to cover the cost of most abortions. The governor issued an executive order to shield those seeking or providing abortions in Nevada from laws in other states.","fill":"#b3d0c7"},{"state":"New Hampshire","abbr":"NH","status":"Legal but limited","legalUntil":"24 weeks","why":"Abortion will most likely stay accessible, though it is not expressly protected by state law and state funds cannot be used to cover the cost of most abortions. The state repealed a pre-Roe ban on abortion in 1997.","fill":"#b3d0c7"},{"state":"Rhode Island","abbr":"RI","status":"Legal but limited","legalUntil":"Viability","why":"State law protects abortion but state funds cannot be used to cover the cost of most abortions. The governor issued an executive order to shield those seeking or providing abortions in Rhode Island from laws in other states.","fill":"#b3d0c7"},{"state":"Pennsylvania","abbr":"PA","status":"Legal but limited","legalUntil":"24 weeks","why":"Abortion is not protected by state law. The state has enacted multiple restrictions that limit access to the procedure, and state funds cannot be used to cover the cost of most abortions. Republicans control the state legislature, but the governor, a Democrat, has vetoed abortion restrictions. The governor issued an executive order this year that shields those seeking or providing abortions in Pennsylvania from laws in other states.","fill":"#b3d0c7"},{"state":"Virginia","abbr":"VA","status":"Legal but limited","legalUntil":"Viability","why":"Abortion will most likely stay accessible, though it is not expressly protected by state law and state funds cannot be used to cover the cost of most abortions. Split control of the state legislature may prevent significant changes until the next election, in 2023.","fill":"#b3d0c7"},{"state":"Washington, D.C.","status":"Legal but limited","legalUntil":"No gestational limit","why":"Local law protects abortion throughout pregnancy. The city plans to bolster protections, though Congress ultimately oversees the city’s laws. Congress prohibits the use of taxpayer funds to cover the cost of most abortions in the city.","fill":"#b3d0c7"},{"state":"Alaska","abbr":"AK","status":"Legal","legalUntil":"No gestational limit","why":"The state’s Supreme Court has recognized a right to “reproductive choice” under its Constitution.","fill":"#6fa194"},{"state":"California","abbr":"CA","status":"Legal","legalUntil":"Viability","why":"State law protects abortion, and the governor signed a bill to shield abortion providers from out-of-state bans. Voters will decide in November whether to adopt an amendment to protect abortion rights.","fill":"#6fa194"},{"state":"Connecticut","abbr":"CT","status":"Legal","legalUntil":"Viability","why":"State law protects abortion. A law expanding which clinicians can provide abortions took effect July 1. The law also shields both providers and patients from out-of-state lawsuits.","fill":"#6fa194"},{"state":"Hawaii","abbr":"HI","status":"Legal","legalUntil":"Viability","why":"State law protects abortion, and a new law expands access to providers.","fill":"#6fa194"},{"state":"Illinois","abbr":"IL","status":"Legal","legalUntil":"Viability","why":"The state’s Supreme Court has recognized abortion protections under its Constitution, and state law protects the procedure.","fill":"#6fa194"},{"state":"Maine","abbr":"ME","status":"Legal","legalUntil":"Viability","why":"State law protects abortion. The governor issued an executive order to shield those seeking or providing abortions in Maine from laws in other states.","fill":"#6fa194"},{"state":"Maryland","abbr":"MD","status":"Legal","legalUntil":"Viability","why":"State law protects abortion, and new laws increase access to providers and insurance coverage.","fill":"#6fa194"},{"state":"Massachusetts","abbr":"MA","status":"Legal","legalUntil":"24 weeks","why":"The Massachusetts Supreme Judicial Court has recognized the right to abortion under its Constitution. Recently enacted laws protect abortion, and the governor issued an executive order to shield those seeking or providing abortions in Massachusetts from laws in other states.","fill":"#6fa194"},{"state":"Minnesota","abbr":"MN","status":"Legal","legalUntil":"Viability","why":"The state’s Supreme Court has recognized the right to abortion under its Constitution. The governor issued an executive order to shield those seeking or providing abortions in Minnesota from laws in other states.","fill":"#6fa194"},{"state":"New Jersey","abbr":"NJ","status":"Legal","legalUntil":"No gestational limit","why":"State law protects abortion throughout pregnancy, and the governor has proposed making the state a “sanctuary” for those seeking the procedure.","fill":"#6fa194"},{"state":"New Mexico","abbr":"NM","status":"Legal","legalUntil":"No gestational limit","why":"Abortion will most likely stay accessible, though it is not expressly protected by state law. The governor issued an executive order to shield those seeking or providing abortions in New Mexico from laws in other states.","fill":"#6fa194"},{"state":"New York","abbr":"NY","status":"Legal","legalUntil":"Viability","why":"State law protects abortion. Legislators have proposed other protections, including an amendment to the State Constitution.","fill":"#6fa194"},{"state":"Oregon","abbr":"OR","status":"Legal","legalUntil":"No gestational limit","why":"State law protects abortion throughout pregnancy, and the Legislature approved $15 million to support those seeking the procedure.","fill":"#6fa194"},{"state":"Vermont","abbr":"VT","status":"Legal","legalUntil":"No gestational limit","why":"State law protects abortion throughout pregnancy. In November, voters will decide if the State Constitution should include abortion protections.","fill":"#6fa194"},{"state":"Washington","abbr":"WA","status":"Legal","legalUntil":"Viability","why":"State law protects abortion, and recent laws expand access to providers.","fill":"#6fa194"}]